local E, C, L = select(2, ...):unpack()

----------------------------------------------------------------------------------------
--	Configuration of Nameplates
----------------------------------------------------------------------------------------

C.nameplate.whiteList = {
    -- Buffs
    [642]       = true,     -- 圣盾术
    [1022]      = true,     -- 保护之手
    [23920]     = true,     -- 法术反射
    [45438]     = true,     -- 寒冰屏障
    [186265]    = true,     -- 灵龟守护
    -- Debuffs  
    [2094]      = true,     -- 致盲
    [10326]     = true,	    -- 超度邪恶
    [20549]     = true,     -- 战争践踏
    [107079]    = true,     -- 震山掌
    [117405]	= true,		-- 束缚射击
    [127797]	= true,		-- 乌索尔旋风
    [272295]    = true,     -- 悬赏
    -- Mythic+
    [228318]	= true,		-- 激怒
    [226510]	= true,		-- 血池
    [343553]	= true,		-- 万噬之怨
    [343502]	= true,		-- 鼓舞光环
    -- Dungeons
	[113315]    = true,	    -- 青龙寺，强烈
	[113309]    = true,	    -- 青龙寺，至高能量
}

C.nameplate.blackList = {
    [15407]     = true,     -- 精神鞭笞
    [51714]     = true,     -- 锋锐之霜
    [199721]    = true,     -- 腐烂光环
    [214968]    = true,     -- 死灵光环
    [214975]    = true,     -- 抑心光环
    [273977]    = true,     -- 亡者之握
    [276919]    = true,     -- 承受压力
    [206930]    = true,     -- 心脏打击
}

-- 特殊单位的染色列表
C.nameplate.customUnits = {
    -- Nzoth vision
    [153401]    = true, 	-- 克熙尔支配者
    [157610]    = true, 	-- 克熙尔支配者
    [156795]    = true, 	-- 军情七处线人
    -- Dungeons
    [120651]    = true, 	-- 大米，爆炸物
    [174773]    = true, 	-- 大米，怨毒影魔
    [104251]    = true, 	-- 群星庭院，哨兵
	[196548]    = true,	    -- 古树树枝，学院
    -- Condemned Demon
    [169430]    = true,
    [169428]    = true,
    [168932]    = true,
    [169425]    = true,
    [169429]    = true,
    [169421]    = true,
    [169426]    = true,
}   

-- 重要读条高亮
C.nameplate.majorSpells = {
	[156718] = true,	-- 骨疽爆裂，影月墓地
	[156776] = true,	-- 虚空撕裂，影月墓地
	[198595] = true,	-- 雷霆飞弹，英灵殿
	[396812] = true,	-- 秘法冲击，学院
	[397889] = true,	-- 海潮爆发，青龙寺
	[395859] = true,	-- 游荡尖啸，青龙寺
	[397878] = true,	-- 魔化涟漪，青龙寺
	[392451] = true,	-- 闪火，红玉
	[392452] = true,	-- 闪火，红玉
	[385536] = true,	-- 烈焰之舞，红玉
}